hpmicro/zephyr_sdk_glue/include/dt-bindings/clock/hpm6280-clocks.h
/*
 * Copyright (c) 2024 HPMicro
 *SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6280_CLOCKS_H
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6280_CLOCKS_H

/*
 *
 *<---------------------- AUTO_GENERATE ---------------------->
 *    This file was auto-generated, do not edit anything.
 *    generated on 2024-09-13 14:28:09 
 */

#define CLK_SRC_OSC24M  0
#define CLK_SRC_PLL0_CLK0  1
#define CLK_SRC_PLL0_CLK1  2
#define CLK_SRC_PLL0_CLK2  3
#define CLK_SRC_PLL1_CLK0  4
#define CLK_SRC_PLL1_CLK1  5
#define CLK_SRC_PLL2_CLK0  6
#define CLK_SRC_PLL2_CLK1  7
#define CLK_SRC_OSC32K  8
#define CLK_ADC_SRC_ANA0  16
#define CLK_ADC_SRC_ANA1  16
#define CLK_ADC_SRC_ANA2  16
#define CLK_ADC_SRC_AHB0  17
#define CLK_DAC_SRC_ANA3  112
#define CLK_DAC_SRC_ANA4  112
#define CLK_DAC_SRC_AHB0  113
#define CLK_WDG_SRC_AHB0  48
#define CLK_WDG_SRC_OSC32K  49
#define CLK_PWDG_SRC_OSC24M  176
#define CLK_PWDG_SRC_OSC32K  177
#define CLK_SRC_INVALID  255

#define CLOCK_CPU0  2556
#define CLOCK_MCHTMR0  17039360
#define CLOCK_CPU1  526844
#define CLOCK_MCHTMR1  17170433
#define CLOCK_XPI0  20447234
#define CLOCK_GPTMR0  17629187
#define CLOCK_GPTMR1  17694724
#define CLOCK_GPTMR2  17760261
#define CLOCK_GPTMR3  17825798
#define CLOCK_UART0  18677767
#define CLOCK_UART1  18743304
#define CLOCK_UART2  18808841
#define CLOCK_UART3  18874378
#define CLOCK_UART4  18939915
#define CLOCK_UART5  19005452
#define CLOCK_UART6  19070989
#define CLOCK_UART7  19136526
#define CLOCK_I2C0  17367055
#define CLOCK_I2C1  17432592
#define CLOCK_I2C2  17498129
#define CLOCK_I2C3  17563666
#define CLOCK_SPI0  18350099
#define CLOCK_SPI1  18415636
#define CLOCK_SPI2  18481173
#define CLOCK_SPI3  18546710
#define CLOCK_CAN0  19529751
#define CLOCK_CAN1  19595288
#define CLOCK_CAN2  19660825
#define CLOCK_CAN3  19726362
#define CLOCK_LIN0  19202083
#define CLOCK_LIN1  19267620
#define CLOCK_LIN2  19333157
#define CLOCK_LIN3  19398694
#define CLOCK_AHB  4294772222
#define CLOCK_AXI  4294772477
#define CLOCK_AXIC  16910077
#define CLOCK_AXIS  16844541
#define CLOCK_AHBP  16778750
#define CLOCK_PTPC  19464219
#define CLOCK_REF0  20971553
#define CLOCK_REF1  21037090
#define CLOCK_WATCHDOG0  19792640
#define CLOCK_WATCHDOG1  19858177
#define CLOCK_PUART  4294902784
#define CLOCK_PTMR  4294902785
#define CLOCK_PWDG  4294904576
#define CLOCK_SDP  20710912
#define CLOCK_XDMA  20579841
#define CLOCK_ROM  17237506
#define CLOCK_RAM0  17303043
#define CLOCK_USB0  20907524
#define CLOCK_KMAN  20645120
#define CLOCK_GPIO  17892609
#define CLOCK_MBX0  19924226
#define CLOCK_HDMA  20514051
#define CLOCK_RNG  20776196
#define CLOCK_MOT0  20120837
#define CLOCK_MOT1  20186374
#define CLOCK_MOT2  20251911
#define CLOCK_MOT3  20317448
#define CLOCK_CRC0  20055305
#define CLOCK_ACMP  18285834
#define CLOCK_SYNT  20382987
#define CLOCK_SDM0  18613517
#define CLOCK_MBX1  19989774
#define CLOCK_LMM0  16976128
#define CLOCK_LMM1  17107201
#define CLOCK_TSNS  20842754
#define CLOCK_ANA0  4294901788
#define CLOCK_ANA1  4294901789
#define CLOCK_ANA2  4294901790
#define CLOCK_ADC0  17957120
#define CLOCK_ADC1  18022657
#define CLOCK_ADC2  18088194
#define CLOCK_ANA3  4294901791
#define CLOCK_ANA4  4294901792
#define CLOCK_DAC0  18155264
#define CLOCK_DAC1  18220801
#define CLK_OSC0CLK0  2099712
#define CLK_PLL0CLK0  2230785
#define CLK_PLL0CLK1  2296322
#define CLK_PLL0CLK2  2361859
#define CLK_PLL1CLK0  2492932
#define CLK_PLL1CLK1  2558469
#define CLK_PLL2CLK0  2689542
#define CLK_PLL2CLK1  2755079


#endif  /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HPM6280_CLOCKS_H */
